In [33]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

import seaborn as sns

## TB

In [42]:
lf = pd.read_csv( 'tb_tidy.csv' )

In [43]:
lf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11492 entries, 0 to 11491
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   country       11492 non-null  object
 1   year          11492 non-null  int64
 2   sex           11492 non-null  object
 3   total_number  11492 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 359.2+ KB

In [44]:
lf.head()

  country  year sex  total_number
0      AD  1989   f           0.0
1      AD  1989   m           0.0
2      AD  1990   f           0.0
3      AD  1990   m           0.0
4      AD  1991   f           0.0

In [45]:
lf.nunique()

country          212
year              29
sex                2
total_number    2415
dtype: int64

In [46]:
country_info = lf.groupby(['country']).size().reset_index(name='num_rows')
country_info.drop(columns=['num_rows'], inplace=True)
#this make a simpler table with just country

In [47]:
country_info

    country
0        AD
1        AE
2        AF
3        AG
4        AI
..      ...
207      YE
208      YU
209      ZA
210      ZM
211      ZW

[212 rows x 1 columns]

In [48]:
country_info['country_id'] = country_info.index + 1

In [49]:
country_info

    country  country_id
0        AD           1
1        AE           2
2        AF           3
3        AG           4
4        AI           5
..      ...         ...
207      YE         208
208      YU         209
209      ZA         210
210      ZM         211
211      ZW         212

[212 rows x 2 columns]

In [50]:
sex_info = lf.groupby(['sex']).size().reset_index(name='num_rows')
sex_info.drop(columns=['num_rows'], inplace=True)

In [51]:
sex_info

  sex
0   f
1   m

In [52]:
sex_info['sex_id'] = sex_info.index + 1

In [53]:
sex_info

  sex  sex_id
0   f       1
1   m       2

In [28]:
lf_copy = pd.merge( lf, country_info.loc[:, ['country_id', 'country']], on='country', how='left').\
merge(sex_info.loc[:, ['sex', 'sex_id']], on='sex', how='left')

In [55]:
lf_copy.drop(columns=['country', 'sex'], inplace=True)

In [57]:
lf_copy.head()

   year  total_number  country_id  sex_id
0  1989           0.0           1       1
1  1989           0.0           1       2
2  1990           0.0           1       1
3  1990           0.0           1       2
4  1991           0.0           1       1

In [58]:
tb_per_year = lf_copy.copy()

In [60]:
tb_per_year['id'] = tb_per_year.index + 1

In [61]:
tb_per_year.head()

   year  total_number  country_id  sex_id  id
0  1989           0.0           1       1   1
1  1989           0.0           1       2   2
2  1990           0.0           1       1   3
3  1990           0.0           1       2   4
4  1991           0.0           1       1   5

## Save the datasets

In [62]:
country_info.to_csv('country_info.csv', header=True, index=False)

In [63]:
sex_info.to_csv('sex.csv', header=True, index=False)

In [64]:
tb_per_year.to_csv('tb_per_year.csv', header=True, index=False)